<!doctype html public "-//W3C//DTD HTML 3.2//EN" "http://www.w3.org/TR/REC-html32#dtd">
<html lang="es">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"> 
<title>Manual de usuario de Moe: Opciones avanzadas</title>
</head>
<body bgcolor="white" text="black">

<div align="right">
<h1><font color="orange">Configuraciones avanzadas</font></h1>
</div>

<a name="lock"></a>
<h2><img align="absmiddle" src="../img/b01s_y.gif">Bloquear posici&oacute;n</h2>

<p>
Haz clic con el bot&oacute;n secundario del rat&oacute;n,
selecciona &quot;Bloquear&quot; desde el men&uacute;,
y la posici&oacute;n de la mascota ser&aacute; bloqueada.
Una mascota bloqueada permanecer&aacute; en la misma posici&oacute;n
a&uacute;n si se intenta arrastrarla.
</p>

<p>
Haz clic sobre la mascota manteniendo presionadas las teclas <kbd>Alt+May&uacute;s+Ctrl</kbd>
para que aparezcan dos opciones adicionales en el men&uacute;:
&quot;Bloquear X&quot; y &quot;Bloquear Y&quot;.
Selecciona &quot;Bloquear Y&quot;
para anular el bloqueo de movimiento vertical
y podr&aacute;s arastrar la mascota hacia arriba y hacia abajo.
</p>

<a name="resize"></a>
<h2><img align="absmiddle" src="../img/b01s_g.gif">Cambiar tama&ntilde;o</h2>

<p>
Haz clic sobre la mascota con el bot&oacute;n secundario del rat&oacute;n,
selecciona &quot;Tama&ntilde;o&quot;,
y podr&aacute;s cambiar el tama&ntilde;o de la mascota a aquel deseado.
Si la mascota es demasiado grande como para ser visualizada en pantalla
utiliza esta funci&oacute;n para ajustarla a la resoluci&oacute;n m&aacute;s adecuada.
</p>

<a name="polling"></a>
<h2><img align="absmiddle" src="../img/b01s_sb.gif">Establecer frecuencia de actualizaci&oacute;n</h2>

<p>
Haz clic sobre la mascota con el bot&oacute;n secundario del rat&oacute;n,
selecciona &quot;Pesta&ntilde;eo&quot;,
y podr&aacute;s cambiar la frecuencia de pesta&ntilde;eo.
Si consideras que la frecuencia de pesta&ntilde;eo es demasiado lenta o demasiado r&aacute;pida,
puedes utilizar esta funci&oacute;n para corregir su comportamiento.
</p>

<p>
Haz clic sobre la mascota con el bot&oacute;n secundario del rat&oacute;n,
selecciona &quot;Sondeo&quot;,
y podras establecer el intervalo de sondeo para detectar ventanas activas.
Si la carga del procesador es demasiado alta,
considera modificar el valor con esta funci&oacute;n.
</p>

<p>
Haz clic sobre la mascota con el bot&oacute;n secundario del rat&oacute;n,
selecciona &quot;Volver a dibujar&quot;,
para configurar el tiempo de retraso para que la mascota se vuelva a dibujar en pantalla.
En caso de que se dibuje basura detr&aacute;s de la mascota, 
utiliza esta funci&oacute;n para corregir ese comportamiento.
</p>

<a name="ignore"></a>
<h2><img align="absmiddle" src="../img/b01s_pp.gif">Ignorar aplicaciones espec&iacute;ficas</h2>

<p>
Haz clic sobre la mascota con el bot&oacute;n secundario del rat&oacute;n,
selecciona &quot;Ignorar esta aplicaci&oacute;n&quot;,
de forma de que la mascota a partir de entonces ignore la aplicaci&oacute;n activa seleccionada.
</p>

<p>
Si deseas quitar a una aplicaci&oacute;n de la lista de ignoradas,
haz clic sobre la mascota manteniendo presionadas las teclas <kbd>Alt+Shift+Ctrl</kbd>,
y selecciona la aplicaci&oacute;n desde el submen&uacute; &quot;Quitar de la lista de ignoradas&quot;.
</p>

<p>
Si deseas que la mascota solamente se visualice
en tu ventana o aplicaci&oacute;n preferida,
haz clic sobre la mascota manteniendo presionadas las teclas <kbd>Alt+Shift+Ctrl</kbd>,
seleciona &quot;Esta aplicaci&oacute;n&quot;
o &quot;Esta ventana de esta aplicaci&oacute;n&quot;
en el submen&uacute; &quot;Mostrar solamente en&quot; 
</p>

</body>
</html>

