<!doctype html public "-//W3C//DTD HTML 3.2//EN" "http://www.w3.org/TR/REC-html32#dtd">
<html lang="es">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1"> 
<title>Manual de usuario de Moe: Historial de creaci&oacute;n</title>
</head>
<body bgcolor="white" text="black">

<div align="right">
<h1><font color="orange">Historial</font></h1>
</div>

<h2>Errores conocidos</h2>

<p>
A veces, cuando se cierra Moe,
la ventana causa un punto muerto y permanece en pantalla.
</p>

<h2>09/04/2001 versi&oacute;n 1.1.2</h2>

<p>
Correcci&oacute;n de error.
Fuga de memoria durante la animaci&oacute;n.
</o>

<h2>25/02/2001 versi&oacute;n 1.1.1</h2>

<p>
Correcci&oacute;n de error.
El error apareci&oacute; en la versi&oacute;n 1.1.0. 
La aplicaci&oacute;n se congelaba cuando se abr&iacute;a el men&uacute;.
</p>

<h2>25/02/2001 versi&oacute;n 1.1.0</h2>

<p>
Nueva caracter&iacute;stica.
Se a&ntilde;ade una consola.
Cuando escribes opciones de l&iacute;nea de comandos desde la Terminal,
si Moe ya está ejecut&aacute;ndose,
el informe de ejecuci&oacute;n del comando se redirige a la consola.
</p>

<p>
Correcci&oacute;n de error.
Se hab&iacute;a agregado un marco innecesario para la animaci&oacute;n.
</p>

<p>
Nueva caracter&iacute;stica.
Se a&ntilde;adió la opci&oacute;n del men&uacute; "Mostrar solamente en".
</p>

<h2>21/02/2001 versi&oacute;n 1.0.0</h2>

<p>
Lanzamiento p&uacute;blico.
</p>

<h2>20/02/2001 versi&oacute;n 1.0.0 b3</h2>

<p>
Mejora.
Cuando un traductor retorna un valor alfa inv&aacute;lido para un mapa de bits,
Moe lo corrige autom&aacute;ticamente.
</p>

<p>
Correcci&oacute;n de error.
Anime no estaba siendo dibujado correctamente cuando
la regi&oacute;n anime est&aacute; afuera de la regi&oacute;n de la imagen base.
</p>

<p>
Nueva caracter&iacute;stica.
Se a&ntilde;aden las opci&oacute;nes de l&iacute;nea de comandos '--delete-anime' e '--info'.
</p>

<p>
Nueva caracter&iacute;stica.
Ahora puedes elegir el lado base de la mascota.
</p>

<h2>19/02/2001 versi&oacute;n 1.0.0 b2</h2>

<p>
Correcci&oacute;n de error.
El dibujo de la mascota se <i>confund&iacute;a</i>
cuando se cambiaba de ventana active mientras la animaci&oacute;n se estaba reproduciendo.
</p>

<p>
Nueva caracter&iacute;stica.
Ahora puedes configurar la frecuencia de pesta&ntilde;eo.
</p>

<h2>18/02/2001 versi&oacute;n 1.0.0 b1</h2>

<p>
Correcci&oacute;n de error.
La mascota se iba volando fuera de la pantalla
cuando estaba activo ffm (<i>focus follows mouse</i>).
</p>

<p>
Nueva caracter&iacute;stica.
Ahora puedes mostrar el marco de depuraci&oacute;n.
</p>

<p>
Correcci&oacute;n de error.
El tama&ntilde;o de animaci&oacute;n era inv&aacute;lido cuando se cambiaba el tama&ntilde;o de la mascota.
</p>

<h2>17/02/2001versi&oacute;n 0.1.0 d14</h2>

<p>
Nueva caracter&iacute;stica.
Ahora Moe puede mostrar animaciones.
</p>

<h2>13/02/2001 versi&oacute;n 0.1.0 d13</h2>

<p>
Mejora.
Modificaci&oacute;n para detectar autom&aacute;ticamente la decoraci&oacute;n de la ventana 
y ajustar la posición en donde se sienta la mascota.
</p>

<p>
Nueva caracter&iacute;stica.
Ahora puedes cambiar el tama&ntilde;o de la mascota.
</p>

<h2>12/02/2001 versi&oacute;n 0.1.0 d12</h2>

<p>
Se cre&oacute; este documento.
</p>

</body>
</html>

